docs/journal/transformer.org
* masking current step in self-attention

the current step almost always gets the highest attention weight,
but it is not necessary to consider itself since the residual connection will add itself back anyways.
[[https://arxiv.org/abs/1711.02281][gu et al. (2018)]] suggested masking current steps.
on the other hand, if the other steps offer no valuable info, current step should simply trust in itself.

empirically i found that the mask is useful.
the model does not learn as fast without the mask.

however when causal mask is present to enforce the autoregressive structure,
adding this mask means that the first and the last steps have nothing to attend to,
which results in nans.

consider these two alternatives.
- =padbos=: pad additional bos symbols to the input sequence,
  sacrifice (slice off) one bos at each self-attention layer when providing the attention queries.
- =padnil=: pad one initial step for the attention values, similar to causal convolution.

=padbos= is slightly messier to implement, however both alternatives are as efficient as the original =nomask=.
all three performs similarly, with =padnil= slightly better ([[https://github.com/ysmiraak/eti/tree/master/docs/stats/decoder-current-step-mask.acc.csv][stats]] per 250 updates).

* affine vs linear

affine transformation is not necessary.

| =smsm-samsam= | 100k | 200k |
|---------------+------+------|
| affine        | 32.7 | 33.5 |
| linear        | 32.5 | 33.6 |

* convolutional attention

[[https://arxiv.org/abs/1810.13320][yang et al.]] proposed convolutional self-attention.
the 1d version is basically the restricted attention mentioned by [[https://arxiv.org/abs/1706.03762][vaswani et al.]] in the original transformer paper.
the 2d version also queries across attention heads, which allows the averaging not to be simply component-wise.

* convolution with attention

how much attention do you need?  [[https://aclweb.org/anthology/P18-1167][domhan 2018]]

stacking self-attention layers is wasteful.
all but the layers which connect to data show interesting patterns,
the others are mostly diagonal.
considering the cost of a attention layer is much higher than that of a convolutional layer,
we can replace some of them with convolution.

since the most expensive part with attention is in fact the mlp that follows.
hopefully that can be replaced with convolution as well.

** encoder

- in the encoder, conv blocks followed by self-attention works better than having just self-attention layers
- removing self-attention (fully convolutional like conv seq2seq) significantly reduced performance
- since conv is not the only force at work (self-attention), receptive field is not important,
  and complicated design (inception) does not help, only makes it more difficult to learn
  + filter banks (inception) don't help
  + filter size 3 and 2 performs the same
  + conv block 4 vs 6 performs the same
  + in each block, twice conv vs once performs the same
- conv dimensions around 128 is optimal, 64 works as well, 32 is too small, 256 too large
- non-linearity is more important than more convolution

| arch                  | 100k | 200k | conv block                         |    b |       k |
|-----------------------+------+------+------------------------------------+------+---------|
| smsm-samsam           | 32.5 | 33.6 |                                    |      |         |
| c6-samsam             | 31.4 | 32.3 | ante      conv relu conv relu post |  128 |       3 |
| c6sm-samsam           | 32.9 | 33.9 | ante      conv relu conv relu post |  128 |       2 |
| c4sm-samsam           | 32.9 | 33.9 | ante      conv relu conv relu post |  128 |       2 |
|-----------------------+------+------+------------------------------------+------+---------|
| c4sm-samsam_reluante  | 33.2 | 33.8 | ante relu conv relu conv relu post |  128 |       2 |
| c4sm-samsam_reluante2 | 32.9 | 33.9 | ante relu conv relu           post |  128 |       2 |
| c4sm-samsam_relu1     | 32.7 | 33.5 | ante      conv relu           post |  128 |       2 |
| c4sm-samsam_glu       | 32.9 | 33.9 | ante      conv glu            post |  128 |       2 |
| c4sm-samsam_grelu     | 32.9 |  n/a | ante relu conv glu            post |  128 |       2 |
| c1sm-samsam_glublock  | 33.0 | 33.8 | ante     (conv glu) x4        post |  128 |       2 |
| c2sm-samsam_glublock  | 33.0 | 34.1 | ante     (conv glu) x4        post |  128 |       2 |
| c2sm-samsam_block     | 32.9 | 33.9 | ante     (conv relu) x4       post |  128 |       2 |
|-----------------------+------+------+------------------------------------+------+---------|
| c4sm-samsam_bank      | 31.8 |  n/a | ante relu conv relu           post | 64*4 | 1 2 3 4 |
| c4sm-samsam_fs3       | 33.0 | 33.7 | ante relu conv relu           post |  128 |       3 |
| c4sm-samsam_fs3x2     | 32.9 | 33.9 | ante      conv relu conv relu post |  128 |       3 |
|-----------------------+------+------+------------------------------------+------+---------|
| c4sm-samsam_double    | 33.0 | 33.8 | ante      conv relu conv relu post |  256 |       2 |
| c4sm-samsam_half      | 32.9 | 33.9 | ante      conv relu conv relu post |   64 |       2 |
| c4sm-samsam_halfhalf  | 32.5 | 33.5 | ante      conv relu conv relu post |   32 |       2 |

