docs/journal/transformer.html

<div id="outline-container-orgb4fe2a0" class="outline-2">
<h2 id="orgb4fe2a0"><span class="section-number-2">4</span> masking current step in self-attention</h2>
<div class="outline-text-2" id="text-4">
<p>
the current step almost always gets the highest attention weight,
but it is not necessary to consider itself since the residual connection will add itself back anyways.
<a href="https://arxiv.org/abs/1711.02281">gu et al. (2018)</a> suggested masking current steps.
on the other hand, if the other steps offer no valuable info, current step should simply trust in itself.
</p>

<p>
empirically i found that the mask is useful.
the model does not learn as fast without the mask.
</p>

<p>
however when causal mask is present to enforce the autoregressive structure,
adding this mask means that the first and the last steps have nothing to attend to,
which results in nans.
</p>

<p>
consider these two alternatives.
</p>
<ul class="org-ul">
<li><code>padbos</code>: pad additional bos symbols to the input sequence,
sacrifice (slice off) one bos at each self-attention layer when providing the attention queries.</li>
<li><code>padnil</code>: pad one initial step for the attention values, similar to causal convolution.</li>
</ul>

<p>
<code>padbos</code> is slightly messier to implement, however both alternatives are as efficient as the original <code>nomask</code>.
all three performs similarly, with <code>padnil</code> slightly better (<a href="https://github.com/ysmiraak/eti/tree/master/docs/stats/decoder-current-step-mask.acc.csv">stats</a> per 250 updates).
</p>
</div>
</div>

<div id="outline-container-org4672dd4" class="outline-2">
<h2 id="org4672dd4"><span class="section-number-2">5</span> affine vs linear</h2>
<div class="outline-text-2" id="text-5">
<p>
affine transformation is not necessary.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><code>smsm-samsam</code></th>
<th scope="col" class="org-right">100k</th>
<th scope="col" class="org-right">200k</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">affine</td>
<td class="org-right">32.7</td>
<td class="org-right">33.5</td>
</tr>

<tr>
<td class="org-left">linear</td>
<td class="org-right">32.5</td>
<td class="org-right">33.6</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org7f38ee5" class="outline-2">
<h2 id="org7f38ee5"><span class="section-number-2">6</span> convolutional attention</h2>
<div class="outline-text-2" id="text-6">
<p>
<a href="https://arxiv.org/abs/1810.13320">yang et al.</a> proposed convolutional self-attention.
the 1d version is basically the restricted attention mentioned by <a href="https://arxiv.org/abs/1706.03762">vaswani et al.</a> in the original transformer paper.
the 2d version also queries across attention heads, which allows the averaging not to be simply component-wise.
</p>
</div>
</div>

<div id="outline-container-org6381c2e" class="outline-2">
<h2 id="org6381c2e"><span class="section-number-2">7</span> convolution with attention</h2>
<div class="outline-text-2" id="text-7">
<p>
how much attention do you need?  <a href="https://aclweb.org/anthology/P18-1167">domhan 2018</a>
</p>

<p>
stacking self-attention layers is wasteful.
all but the layers which connect to data show interesting patterns,
the others are mostly diagonal.
considering the cost of a attention layer is much higher than that of a convolutional layer,
we can replace some of them with convolution.
</p>

<p>
since the most expensive part with attention is in fact the mlp that follows.
hopefully that can be replaced with convolution as well.
</p>
</div>

<div id="outline-container-org4a5b443" class="outline-3">
<h3 id="org4a5b443"><span class="section-number-3">7.1</span> encoder</h3>
<div class="outline-text-3" id="text-7-1">
<ul class="org-ul">
<li>in the encoder, conv blocks followed by self-attention works better than having just self-attention layers</li>
<li>removing self-attention (fully convolutional like conv seq2seq) significantly reduced performance</li>
<li>since conv is not the only force at work (self-attention), receptive field is not important,
and complicated design (inception) does not help, only makes it more difficult to learn
<ul class="org-ul">
<li>filter banks (inception) don't help</li>
<li>filter size 3 and 2 performs the same</li>
<li>conv block 4 vs 6 performs the same</li>
<li>in each block, twice conv vs once performs the same</li>
</ul></li>
<li>conv dimensions around 128 is optimal, 64 works as well, 32 is too small, 256 too large</li>
<li>non-linearity is more important than more convolution</li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">arch</th>
<th scope="col" class="org-right">1</th>
<th scope="col" class="org-right">2</th>
<th scope="col" class="org-left">conv block</th>
<th scope="col" class="org-right">n</th>
<th scope="col" class="org-right">f</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">smsm-samsam</td>
<td class="org-right">32.5</td>
<td class="org-right">33.6</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">c6-samsam</td>
<td class="org-right">31.4</td>
<td class="org-right">32.3</td>
<td class="org-left">ante      conv relu conv relu post</td>
<td class="org-right">128</td>
<td class="org-right">3</td>
</tr>

<tr>
<td class="org-left">c6sm-samsam</td>
<td class="org-right">32.9</td>
<td class="org-right">33.9</td>
<td class="org-left">ante      conv relu conv relu post</td>
<td class="org-right">128</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-left">c4sm-samsam</td>
<td class="org-right">32.9</td>
<td class="org-right">33.9</td>
<td class="org-left">ante      conv relu conv relu post</td>
<td class="org-right">128</td>
<td class="org-right">2</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">c4sm-samsam<sub>reluante</sub></td>
<td class="org-right">33.2</td>
<td class="org-right">33.8</td>
<td class="org-left">ante relu conv relu conv relu post</td>
<td class="org-right">128</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-left">c4sm-samsam<sub>reluante2</sub></td>
<td class="org-right">32.9</td>
<td class="org-right">33.9</td>
<td class="org-left">ante relu conv relu           post</td>
<td class="org-right">128</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-left">c4sm-samsam<sub>relu1</sub></td>
<td class="org-right">32.7</td>
<td class="org-right">33.5</td>
<td class="org-left">ante      conv relu           post</td>
<td class="org-right">128</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-left">c4sm-samsam<sub>glu</sub></td>
<td class="org-right">32.9</td>
<td class="org-right">33.9</td>
<td class="org-left">ante      conv glu            post</td>
<td class="org-right">128</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-left">c4sm-samsam<sub>grelu</sub></td>
<td class="org-right">32.9</td>
<td class="org-right">n/a</td>
<td class="org-left">ante relu conv glu            post</td>
<td class="org-right">128</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-left">c1sm-samsam<sub>glublock</sub></td>
<td class="org-right">33.0</td>
<td class="org-right">33.8</td>
<td class="org-left">ante     (conv glu) x4        post</td>
<td class="org-right">128</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-left">c2sm-samsam<sub>glublock</sub></td>
<td class="org-right">33.0</td>
<td class="org-right">34.1</td>
<td class="org-left">ante     (conv glu) x4        post</td>
<td class="org-right">128</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-left">c2sm-samsam<sub>block</sub></td>
<td class="org-right">32.9</td>
<td class="org-right">33.9</td>
<td class="org-left">ante     (conv relu) x4       post</td>
<td class="org-right">128</td>
<td class="org-right">2</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">c4sm-samsam<sub>bank</sub></td>
<td class="org-right">31.8</td>
<td class="org-right">n/a</td>
<td class="org-left">ante relu conv relu           post</td>
<td class="org-right">64*4</td>
<td class="org-right">1 2 3 4</td>
</tr>

<tr>
<td class="org-left">c4sm-samsam<sub>fs3</sub></td>
<td class="org-right">33.0</td>
<td class="org-right">33.7</td>
<td class="org-left">ante relu conv relu           post</td>
<td class="org-right">128</td>
<td class="org-right">3</td>
</tr>

<tr>
<td class="org-left">c4sm-samsam<sub>fs3x2</sub></td>
<td class="org-right">32.9</td>
<td class="org-right">33.9</td>
<td class="org-left">ante      conv relu conv relu post</td>
<td class="org-right">128</td>
<td class="org-right">3</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">c4sm-samsam<sub>double</sub></td>
<td class="org-right">33.0</td>
<td class="org-right">33.8</td>
<td class="org-left">ante      conv relu conv relu post</td>
<td class="org-right">256</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-left">c4sm-samsam<sub>half</sub></td>
<td class="org-right">32.9</td>
<td class="org-right">33.9</td>
<td class="org-left">ante      conv relu conv relu post</td>
<td class="org-right">64</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-left">c4sm-samsam<sub>halfhalf</sub></td>
<td class="org-right">32.5</td>
<td class="org-right">33.5</td>
<td class="org-left">ante      conv relu conv relu post</td>
<td class="org-right">32</td>
<td class="org-right">2</td>
</tr>
</tbody>
</table>
</div>
</div>
