docs/journal/transformer.org
** glu

- bottleneck 128 is the best
- stacking blocks is better than stacking layers
- bias not necessary even for sigmoid gate
- dropout only necessary for each block
- twin gates \(g \times y + (1-g) \times x\) don't work, make no changes to glu for now

| arch                       | 100k | 200k | k |   b |
|----------------------------+------+------+---+-----|
| csm-samsam                 | 33.0 | 33.8 | 4 | 128 |
| csm-samsam_half            | 33.0 | 33.6 | 4 |  64 |
| csm-samsam_double          | 33.1 | 33.8 | 4 | 256 |
| csm-samsam_depth2          | 32.9 | 33.7 | 2 | 128 |
| csm-samsam_depth3          | 32.8 | 33.9 | 3 | 128 |
| csm-samsam_depth4          | 32.9 | 33.9 | 4 | 128 |
| csm-samsam_depth5          | 32.9 | 33.8 | 5 | 128 |
| csm-samsam_depth6          | 33.0 | 33.8 | 6 | 128 |
| csm-samsam_depth8          | 33.0 | 33.7 | 8 | 128 |
| c3sm-samsam_depth2         | 33.0 | 34.2 | 2 | 128 |
| c2sm-samsam_depth4         | 33.1 | 34.0 | 4 | 128 |
| c2sm-samsam_depth4_nobias  | 33.2 | 34.0 | 4 | 128 |
| c2sm-samsam_depth4_twin    | 33.0 | 33.9 | 4 | 128 |
| c2sm-samsam_depth4_dropout | 33.0 | 33.9 | 4 | 128 |

- consider 512 to be 1 unit

| block             | params |
|-------------------+--------|
| mlp               |      8 |
| att               |      4 |
| conv relu depth 2 |    3/4 |
| conv glu depth 2  |      1 |
| conv glu depth 4  |    1.5 |

** decoder

| arch                    | 100k | 200k |
|-------------------------+------+------|
| smsm-samsam             | 32.6 | 33.7 |
| c3sc3sc3-c3bc3bc3       | 33.0 | 33.8 |
| c3sc3sc3-c3sac3sac3     | 33.3 | 34.1 |
| c3sc3sc3-c3asc3asc3     | 32.9 | 34.1 |
| c3sc3sc3-cscacscacsc    | 33.2 | 34.1 |
| c3sc3sc3-c3asc3ac3sac3  | 33.4 | 34.1 |
| c3sc3sc3-samsam         | 33.1 | 34.3 |
| c3sc3sc3-c3sac3sc3asc3  | 33.4 | 34.3 |
| c3sc3sc3-c3ac3sc3ac3sc3 | 33.4 | 34.5 |
| c3sc3sc3-c3sc3ac3sc3ac3 | 33.3 | 34.6 |

the 0.1 improvement for =smsm-samsam= in comparison to previous results
was due to the addition of an output transformation in attention blocks,
which was stated in the original transformer paper but i missed it.

* complexity

| b | 128 | bottleneck dimension |
| d | 512 | model dimension      |
| t |  64 | time steps           |

ignoring minor costs:
split, stack, scaling, masking, sigmoid, softmax, relu, residual connection, normalization, gain, and bias;
which all have at most \(O(d)\) parameters and \(O(dt)\) complexity.

** mlp layer

| parts      | parameters | complexity |
|------------+------------+------------|
| in         | d d 4      | d d t 4    |
| ex         | d d 4      | d d t 4    |
|------------+------------+------------|
| total      | 8 dd       | 8 ddt      |
| in million | 2.10       | 134.22     |

** attention layer

| parts      | parameters | complexity    |
|------------+------------+---------------|
| key        | d d        | d d t         |
| value      | d d        | d d t         |
| query      | d d        | d d t         |
| output     | d d        | d d t         |
| weight     |            | d t t         |
| average    |            | d t t         |
|------------+------------+---------------|
| total      | 4 dd       | 4 ddt + 2 dtt |
| in million | 1.05       | 71.30         |

** bottleneck glu layer

| parts      | parameters  | complexity    |
|------------+-------------+---------------|
| in         | b d         | b d t         |
| conv1      | b b 2       | b b t 2       |
| gate1      | b b 2       | b b t 2       |
| conv2      | b b 2       | b b t 2       |
| gate2      | b b 2       | b b t 2       |
| ex         | b d         | b d t         |
|------------+-------------+---------------|
| total      | 2 bd + 8 bb | 2 bdt + 8 bbt |
| in million | 0.26        | 16.78         |
