docs/journal/transformer.html

<div id="outline-container-orgc65ee19" class="outline-3">
<h3 id="orgc65ee19"><span class="section-number-3">7.2</span> glu</h3>
<div class="outline-text-3" id="text-7-2">
<ul class="org-ul">
<li>bottleneck 128 is the best</li>
<li>stacking blocks is better than stacking layers</li>
<li>bias not necessary even for sigmoid gate</li>
<li>dropout only necessary for each block</li>
<li>twin gates \(g \times y + (1-g) \times x\) don't work, make no changes to glu for now</li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">arch</th>
<th scope="col" class="org-right">1</th>
<th scope="col" class="org-right">2</th>
<th scope="col" class="org-right">n</th>
<th scope="col" class="org-right">d</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">csm-samsam</td>
<td class="org-right">33.0</td>
<td class="org-right">33.8</td>
<td class="org-right">4</td>
<td class="org-right">128</td>
</tr>

<tr>
<td class="org-left">csm-samsam<sub>half</sub></td>
<td class="org-right">33.0</td>
<td class="org-right">33.6</td>
<td class="org-right">4</td>
<td class="org-right">64</td>
</tr>

<tr>
<td class="org-left">csm-samsam<sub>double</sub></td>
<td class="org-right">33.1</td>
<td class="org-right">33.8</td>
<td class="org-right">4</td>
<td class="org-right">256</td>
</tr>

<tr>
<td class="org-left">csm-samsam<sub>depth2</sub></td>
<td class="org-right">32.9</td>
<td class="org-right">33.7</td>
<td class="org-right">2</td>
<td class="org-right">128</td>
</tr>

<tr>
<td class="org-left">csm-samsam<sub>depth3</sub></td>
<td class="org-right">32.8</td>
<td class="org-right">33.9</td>
<td class="org-right">3</td>
<td class="org-right">128</td>
</tr>

<tr>
<td class="org-left">csm-samsam<sub>depth4</sub></td>
<td class="org-right">32.9</td>
<td class="org-right">33.9</td>
<td class="org-right">4</td>
<td class="org-right">128</td>
</tr>

<tr>
<td class="org-left">csm-samsam<sub>depth5</sub></td>
<td class="org-right">32.9</td>
<td class="org-right">33.8</td>
<td class="org-right">5</td>
<td class="org-right">128</td>
</tr>

<tr>
<td class="org-left">csm-samsam<sub>depth6</sub></td>
<td class="org-right">33.0</td>
<td class="org-right">33.8</td>
<td class="org-right">6</td>
<td class="org-right">128</td>
</tr>

<tr>
<td class="org-left">csm-samsam<sub>depth8</sub></td>
<td class="org-right">33.0</td>
<td class="org-right">33.7</td>
<td class="org-right">8</td>
<td class="org-right">128</td>
</tr>

<tr>
<td class="org-left">c3sm-samsam<sub>depth2</sub></td>
<td class="org-right">33.0</td>
<td class="org-right">34.2</td>
<td class="org-right">2</td>
<td class="org-right">128</td>
</tr>

<tr>
<td class="org-left">c2sm-samsam<sub>depth4</sub></td>
<td class="org-right">33.1</td>
<td class="org-right">34.0</td>
<td class="org-right">4</td>
<td class="org-right">128</td>
</tr>

<tr>
<td class="org-left">c2sm-samsam<sub>depth4</sub><sub>nobias</sub></td>
<td class="org-right">33.2</td>
<td class="org-right">34.0</td>
<td class="org-right">4</td>
<td class="org-right">128</td>
</tr>

<tr>
<td class="org-left">c2sm-samsam<sub>depth4</sub><sub>twin</sub></td>
<td class="org-right">33.0</td>
<td class="org-right">33.9</td>
<td class="org-right">4</td>
<td class="org-right">128</td>
</tr>

<tr>
<td class="org-left">c2sm-samsam<sub>depth4</sub><sub>dropout</sub></td>
<td class="org-right">33.0</td>
<td class="org-right">33.9</td>
<td class="org-right">4</td>
<td class="org-right">128</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>consider 512 to be 1 unit</li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">block</th>
<th scope="col" class="org-right">params</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">mlp</td>
<td class="org-right">8</td>
</tr>

<tr>
<td class="org-left">att</td>
<td class="org-right">4</td>
</tr>

<tr>
<td class="org-left">conv relu depth 2</td>
<td class="org-right">3/4</td>
</tr>

<tr>
<td class="org-left">conv glu depth 2</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">conv glu depth 4</td>
<td class="org-right">1.5</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgad578af" class="outline-3">
<h3 id="orgad578af"><span class="section-number-3">7.3</span> decoder</h3>
<div class="outline-text-3" id="text-7-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">arch</th>
<th scope="col" class="org-right">1</th>
<th scope="col" class="org-right">2</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">smsm-samsam</td>
<td class="org-right">32.6</td>
<td class="org-right">33.7</td>
</tr>

<tr>
<td class="org-left">c3sc3sc3-c3bc3bc3</td>
<td class="org-right">33.0</td>
<td class="org-right">33.8</td>
</tr>

<tr>
<td class="org-left">c3sc3sc3-c3sac3sac3</td>
<td class="org-right">33.3</td>
<td class="org-right">34.1</td>
</tr>

<tr>
<td class="org-left">c3sc3sc3-c3asc3asc3</td>
<td class="org-right">32.9</td>
<td class="org-right">34.1</td>
</tr>

<tr>
<td class="org-left">c3sc3sc3-cscacscacsc</td>
<td class="org-right">33.2</td>
<td class="org-right">34.1</td>
</tr>

<tr>
<td class="org-left">c3sc3sc3-c3asc3ac3sac3</td>
<td class="org-right">33.4</td>
<td class="org-right">34.1</td>
</tr>

<tr>
<td class="org-left">c3sc3sc3-samsam</td>
<td class="org-right">33.1</td>
<td class="org-right">34.3</td>
</tr>

<tr>
<td class="org-left">c3sc3sc3-c3sac3sc3asc3</td>
<td class="org-right">33.4</td>
<td class="org-right">34.3</td>
</tr>

<tr>
<td class="org-left">c3sc3sc3-c3ac3sc3ac3sc3</td>
<td class="org-right">33.4</td>
<td class="org-right">34.5</td>
</tr>

<tr>
<td class="org-left">c3sc3sc3-c3sc3ac3sc3ac3</td>
<td class="org-right">33.3</td>
<td class="org-right">34.6</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-org119981f" class="outline-2">
<h2 id="org119981f"><span class="section-number-2">8</span> complexity</h2>
<div class="outline-text-2" id="text-8">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">b</td>
<td class="org-right">128</td>
<td class="org-left">bottleneck dimension</td>
</tr>

<tr>
<td class="org-left">d</td>
<td class="org-right">512</td>
<td class="org-left">model dimension</td>
</tr>

<tr>
<td class="org-left">t</td>
<td class="org-right">64</td>
<td class="org-left">time steps</td>
</tr>
</tbody>
</table>

<p>
ignoring minor costs:
split, stack, scaling, masking, sigmoid, softmax, relu, residual connection, normalization, gain, and bias;
which all have at most \(O(d)\) parameters and \(O(dt)\) complexity.
</p>
</div>

<div id="outline-container-org63ccf85" class="outline-3">
<h3 id="org63ccf85"><span class="section-number-3">8.1</span> mlp layer</h3>
<div class="outline-text-3" id="text-8-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">parts</th>
<th scope="col" class="org-left">parameters</th>
<th scope="col" class="org-left">complexity</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">in</td>
<td class="org-left">d d 4</td>
<td class="org-left">d d t 4</td>
</tr>

<tr>
<td class="org-left">ex</td>
<td class="org-left">d d 4</td>
<td class="org-left">d d t 4</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">total</td>
<td class="org-left">8 dd</td>
<td class="org-left">8 ddt</td>
</tr>

<tr>
<td class="org-left">in million</td>
<td class="org-left">2.10</td>
<td class="org-left">134.22</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org37a88c6" class="outline-3">
<h3 id="org37a88c6"><span class="section-number-3">8.2</span> attention layer</h3>
<div class="outline-text-3" id="text-8-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">parts</th>
<th scope="col" class="org-left">parameters</th>
<th scope="col" class="org-left">complexity</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">key</td>
<td class="org-left">d d</td>
<td class="org-left">d d t</td>
</tr>

<tr>
<td class="org-left">value</td>
<td class="org-left">d d</td>
<td class="org-left">d d t</td>
</tr>

<tr>
<td class="org-left">query</td>
<td class="org-left">d d</td>
<td class="org-left">d d t</td>
</tr>

<tr>
<td class="org-left">output</td>
<td class="org-left">d d</td>
<td class="org-left">d d t</td>
</tr>

<tr>
<td class="org-left">weight</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">d t t</td>
</tr>

<tr>
<td class="org-left">average</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">d t t</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">total</td>
<td class="org-left">4 dd</td>
<td class="org-left">4 ddt + 2 dtt</td>
</tr>

<tr>
<td class="org-left">in million</td>
<td class="org-left">1.05</td>
<td class="org-left">71.30</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org8086e27" class="outline-3">
<h3 id="org8086e27"><span class="section-number-3">8.3</span> bottleneck glu layer</h3>
<div class="outline-text-3" id="text-8-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">parts</th>
<th scope="col" class="org-left">parameters</th>
<th scope="col" class="org-left">complexity</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">in</td>
<td class="org-left">b d</td>
<td class="org-left">b d t</td>
</tr>

<tr>
<td class="org-left">conv1</td>
<td class="org-left">b b 2</td>
<td class="org-left">b b t 2</td>
</tr>

<tr>
<td class="org-left">gate1</td>
<td class="org-left">b b 2</td>
<td class="org-left">b b t 2</td>
</tr>

<tr>
<td class="org-left">conv2</td>
<td class="org-left">b b 2</td>
<td class="org-left">b b t 2</td>
</tr>

<tr>
<td class="org-left">gate2</td>
<td class="org-left">b b 2</td>
<td class="org-left">b b t 2</td>
</tr>

<tr>
<td class="org-left">ex</td>
<td class="org-left">b d</td>
<td class="org-left">b d t</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">total</td>
<td class="org-left">2 bd + 8 bb</td>
<td class="org-left">2 bdt + 8 bbt</td>
</tr>

<tr>
<td class="org-left">in million</td>
<td class="org-left">0.26</td>
<td class="org-left">16.78</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: kuan yu</p>
<p class="date">Created: 2018-12-17 Mon 23:34</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
